In [2]:
import pyspark
import findspark
findspark.init()

In [3]:
#######  Creating RDD
# 1) using parallelize()
from pyspark.sql import SparkSession
spark=SparkSession.builder.appName("Create RDDs").getOrCreate()
spark

In [4]:
data=[("Sona",22),("Mona",19),("Chinnu",24),("Sunny",23),("Bannu",26)]
rdd=spark.sparkContext.parallelize(data)
rdd.collect()

[('Sona', 22), ('Mona', 19), ('Chinnu', 24), ('Sunny', 23), ('Bannu', 26)]

In [5]:
print(type(rdd))

<class 'pyspark.rdd.RDD'>

In [6]:
# 2) sparkContext.textFile()
data=spark.sparkContext.textFile("C:\\Users\\DELL\\OneDrive\\Desktop\\Data Engineering Python\\DEPython\\app.txt")
data

C:\Users\DELL\OneDrive\Desktop\Data Engineering Python\DEPython\app.txt MapPartitionsRDD[2] at textFile at NativeMethodAccessorImpl.java:0

In [7]:
data.collect()

['I am Sriganga.I am from Nizamabad.Hello WelcomeHello WelcomeHello WelcomeHello Welcome']

In [8]:
print(type(data))

<class 'pyspark.rdd.RDD'>

In [9]:
# 3)using sparkContext.wholeTextFiles()
# Returns a pair RDD with file name-key and text-value
data=spark.sparkContext.wholeTextFiles("C:\\Users\\DELL\\OneDrive\\Desktop\\Data Engineering Python\\DEPython\\app.txt")
data.collect()

[('file:/C:/Users/DELL/OneDrive/Desktop/Data Engineering Python/DEPython/app.txt',
  'I am Sriganga.I am from Nizamabad.Hello WelcomeHello WelcomeHello WelcomeHello Welcome')]

In [10]:
print(type(data))

<class 'pyspark.rdd.RDD'>

In [24]:
# spark.read.format()
# Read data from a file in local file system
df = spark.read.format("text").load("C:\\Users\\DELL\\OneDrive\\Desktop\\Data Engineering Python\\DEPython\\app.txt")

# Split the 'value' column based on spaces and rename it as 'Text_Data'
df = df.selectExpr("split(value, ' ') as Text_Data")

# Show the resulting DataFrame
df.show(4,False)

+-------------------------------------------------------------------------------------------------+
|Text_Data                                                                                        |
+-------------------------------------------------------------------------------------------------+
|[I, am, Sriganga.I, am, from, Nizamabad.Hello, WelcomeHello, WelcomeHello, WelcomeHello, Welcome]|
+-------------------------------------------------------------------------------------------------+

In [12]:
# 4) RDD from CSV file
data=spark.sparkContext.textFile('C:\\Users\\DELL\\OneDrive\\Desktop\\Data Engineering Python\\DEPython\\Example-1.csv')
data.collect()

['ID,Name,Age,Salary',
 '1,Sona,12,12000',
 '2,Mona,21,43000',
 '3,Bannu,13,25000',
 '4,Chinnu,23,10000',
 '5,sunny,14,23000',
 '6,raju,24,78000',
 '7,ram,15,45000',
 '8,lucky,25,50000',
 '9,Appy,17,60000',
 '10,Lekha,38,21890',
 '11,Vinnni,11,78654',
 '12,pavan,19,34567',
 '13,Sita,32,78901',
 '14,latha,33,56455',
 '15,Gita,28,25678']

In [13]:
print(type(data))

<class 'pyspark.rdd.RDD'>

In [14]:
# 5) RDD from json file
data=spark.sparkContext.textFile("C:\\Users\\DELL\\OneDrive\\Desktop\\Data Engineering Python\\DEPython\\teacher.json")
data.collect()

['{"t_name": "Dhana Laxmi", "t_id": 200, "t_age": 43, "t_salary": 45000}']

In [15]:
print(type(data))

<class 'pyspark.rdd.RDD'>

In [16]:
# 6)empty RDD using sparkContext.emptyRDD
data1=spark.sparkContext.emptyRDD()
print(type(data1))

<class 'pyspark.rdd.RDD'>

In [17]:
###### Transforming data with PySpark RDDs
# Actions
from pyspark import SparkContext
sc=SparkContext.getOrCreate()

In [18]:
# 1) collect()
collect_rdd=sc.parallelize([12,3,2,6,4,8,9,44,21,5,49])
print(type(collect_rdd))

<class 'pyspark.rdd.RDD'>

In [19]:
collect_rdd.collect()

[12, 3, 2, 6, 4, 8, 9, 44, 21, 5, 49]

In [20]:
# 2) count()
count_rdd=sc.parallelize([1,5,4,3,3,2,1,66,88,43,11])
print(type(count_rdd))

<class 'pyspark.rdd.RDD'>

In [21]:
count_rdd.count()

11

In [38]:
# 3) first()
first_rdd=sc.parallelize([1888,4,3,66,78,9])
print(type(first_rdd))

<class 'pyspark.rdd.RDD'>

In [39]:
first_rdd.first()

1888

In [40]:
# 4) take(n)
take_rdd=sc.parallelize(['sona','mona',11,'Raju',89,'Dhana',11])
take_rdd.take(3)

['sona', 'mona', 11]

In [41]:
# 5) reduce()
reduce_rdd=sc.parallelize([11,55,66,44])
reduce_rdd.reduce(lambda x,y:x+y)

176

In [ ]:
# 6) saveAsTextfile()
save_rdd=sc.parallelize([2,4,6,7,8])
save_rdd.saveAsTextFile("first.txt")

In [68]:
# 7) min()
rdd=sc.parallelize([6,8,4,22,0,-7,-55])
rdd.min()

-55

In [69]:
rdd.max()

22

In [70]:
rdd.mean()

-3.142857142857143

In [43]:
# Transformations of RDDs
# 1) map()
data=sc.parallelize([1,2,5,8])
data.map(lambda x:x*2).collect()

[2, 4, 10, 16]

In [57]:
# 2)filter()
data=sc.parallelize([6,9,10,22,1,5,3,2,6,33])
data.filter(lambda x:x>9).collect()

[10, 22, 33]

In [63]:
data=sc.parallelize(['sona','sriganaga','mona','sunny','shiva','chinnu'])
data.filter(lambda x:x).collect()

['sona', 'sriganaga', 'mona', 'sunny', 'shiva', 'chinnu']

In [49]:
# 3) union()
data=sc.parallelize([1,2,-4,5,7,-88,55,-44,12,15,0])
union1_rdd=data.filter(lambda x:x>0)
union1_rdd.collect()

[1, 2, 5, 7, 55, 12, 15]

In [50]:
union2_rdd=data.filter(lambda x:x<0)
union2_rdd.collect()

[-4, -88, -44]

In [51]:
union1_rdd.union(union2_rdd).collect()

[1, 2, 5, 7, 55, 12, 15, -4, -88, -44]

In [67]:
# flatMap()
data=sc.parallelize(["Welcome"," to Pyspark tutorial"," on Transforming RDDs"])
data.flatMap(lambda x:x.split(" ")).collect()

['Welcome', '', 'to', 'Pyspark', 'tutorial', '', 'on', 'Transforming', 'RDDs']

In [ ]:
# Transformations from sparkbyexamples
# Narrow transformations--> map(),filter(),union(),flatMap()
# Wider Transformations---> groupByKey(),reduceByKey(),aggregate(),aggregateByKey(),join(),repartition()

In [72]:
# 1) reduceByKey()
##transformation performs multiple parallel processes for each key in the data and combines the values for the same keys
marks_rdd = sc.parallelize([('Rahul', 25), ('Swati', 26), ('Shreya', 22), ('Abhay', 29), ('Rohan', 22), ('Rahul', 23), ('Swati', 19), ('Shreya', 28), ('Abhay', 26), ('Rohan', 22)])
print(marks_rdd.reduceByKey(lambda x, y: x + y).collect())

[('Shreya', 50), ('Rohan', 44), ('Rahul', 48), ('Swati', 45), ('Abhay', 55)]

In [74]:
#2) groupByKey()
dict_rdd=marks_rdd.groupByKey().collect()
for i,j in dict_rdd:
    print(i,list(j))

Shreya [22, 28]
Rohan [22, 22]
Rahul [25, 23]
Swati [26, 19]
Abhay [29, 26]

In [77]:
#3) .sortByKey() Transformation
marks_rdd.sortByKey('ascending').collect()

[('Abhay', 29),
 ('Abhay', 26),
 ('Rahul', 25),
 ('Rahul', 23),
 ('Rohan', 22),
 ('Rohan', 22),
 ('Shreya', 22),
 ('Shreya', 28),
 ('Swati', 26),
 ('Swati', 19)]

In [78]:
# DataFrames
# 1) Creating dataframe from existing RDD
sc=SparkContext.getOrCreate()
spark=SparkSession.builder.appName("Create data frames").getOrCreate()

In [80]:
data=sc.parallelize([('A',"Sona",78,89,45),('B',"Mona",80,45,67),('C',"Chinnu",67,89,20),('D',"Bannu",89,67,56)])
data.collect()

[('A', 'Sona', 78, 89, 45),
 ('B', 'Mona', 80, 45, 67),
 ('C', 'Chinnu', 67, 89, 20),
 ('D', 'Bannu', 89, 67, 56)]

In [81]:
print(type(data))

<class 'pyspark.rdd.RDD'>

In [82]:
columns=["Section","Name","Maths","Physics","Chemistry"]
df=spark.createDataFrame(data,schema=columns)

In [83]:
df.show()

+-------+------+-----+-------+---------+
|Section|  Name|Maths|Physics|Chemistry|
+-------+------+-----+-------+---------+
|      A|  Sona|   78|     89|       45|
|      B|  Mona|   80|     45|       67|
|      C|Chinnu|   67|     89|       20|
|      D| Bannu|   89|     67|       56|
+-------+------+-----+-------+---------+

In [84]:
print(type(df))

<class 'pyspark.sql.dataframe.DataFrame'>

In [85]:
df.printSchema()

root
 |-- Section: string (nullable = true)
 |-- Name: string (nullable = true)
 |-- Maths: long (nullable = true)
 |-- Physics: long (nullable = true)
 |-- Chemistry: long (nullable = true)

In [87]:
# Renaming columns
# 1) withColumnRenamed()
df.withColumnRenamed('Section','Division').show()

+--------+------+-----+-------+---------+
|Division|  Name|Maths|Physics|Chemistry|
+--------+------+-----+-------+---------+
|       A|  Sona|   78|     89|       45|
|       B|  Mona|   80|     45|       67|
|       C|Chinnu|   67|     89|       20|
|       D| Bannu|   89|     67|       56|
+--------+------+-----+-------+---------+

In [90]:
# renaming multiple columns
df1=df.withColumnRenamed('Name','name').withColumnRenamed('Chemistry','Biology')

In [91]:
df1.show()

+-------+------+-----+-------+-------+
|Section|  name|Maths|Physics|Biology|
+-------+------+-----+-------+-------+
|      A|  Sona|   78|     89|     45|
|      B|  Mona|   80|     45|     67|
|      C|Chinnu|   67|     89|     20|
|      D| Bannu|   89|     67|     56|
+-------+------+-----+-------+-------+

In [94]:
# 2) selectExpr(expr)
df.selectExpr("Section as sec","Name","Maths as math","Physics","Chemistry").show()

+---+------+----+-------+---------+
|sec|  Name|math|Physics|Chemistry|
+---+------+----+-------+---------+
|  A|  Sona|  78|     89|       45|
|  B|  Mona|  80|     45|       67|
|  C|Chinnu|  67|     89|       20|
|  D| Bannu|  89|     67|       56|
+---+------+----+-------+---------+

In [96]:
# 3) select(col)
from pyspark.sql.functions import col
data=df.select(col("Section").alias("Division"),col("Name"),col("Maths").alias("math"),col("Physics"),col("Chemistry"))
data.show()

+--------+------+----+-------+---------+
|Division|  Name|math|Physics|Chemistry|
+--------+------+----+-------+---------+
|       A|  Sona|  78|     89|       45|
|       B|  Mona|  80|     45|       67|
|       C|Chinnu|  67|     89|       20|
|       D| Bannu|  89|     67|       56|
+--------+------+----+-------+---------+

In [97]:
# toDF(*col)
li=["Division","Name of Student","Maths","Physics","Chemistry"]
df.toDF(*li).show()

+--------+---------------+-----+-------+---------+
|Division|Name of Student|Maths|Physics|Chemistry|
+--------+---------------+-----+-------+---------+
|       A|           Sona|   78|     89|       45|
|       B|           Mona|   80|     45|       67|
|       C|         Chinnu|   67|     89|       20|
|       D|          Bannu|   89|     67|       56|
+--------+---------------+-----+-------+---------+

In [99]:
# 2) Creating dataframes from External Files
# a) from csv file
df=spark.read.csv('C:\\Users\\DELL\\OneDrive\\Desktop\\Data Engineering Python\\DEPython\\Example-1.csv',sep=',',inferSchema=True,header=True)
print(type(df))
df.show()
df.printSchema()

<class 'pyspark.sql.dataframe.DataFrame'>
+---+------+---+------+
| ID|  Name|Age|Salary|
+---+------+---+------+
|  1|  Sona| 12| 12000|
|  2|  Mona| 21| 43000|
|  3| Bannu| 13| 25000|
|  4|Chinnu| 23| 10000|
|  5| sunny| 14| 23000|
|  6|  raju| 24| 78000|
|  7|   ram| 15| 45000|
|  8| lucky| 25| 50000|
|  9|  Appy| 17| 60000|
| 10| Lekha| 38| 21890|
| 11|Vinnni| 11| 78654|
| 12| pavan| 19| 34567|
| 13|  Sita| 32| 78901|
| 14| latha| 33| 56455|
| 15|  Gita| 28| 25678|
+---+------+---+------+

root
 |-- ID: integer (nullable = true)
 |-- Name: string (nullable = true)
 |-- Age: integer (nullable = true)
 |-- Salary: integer (nullable = true)

In [100]:
# b) from text file
df=spark.read.text("C:\\Users\\DELL\\OneDrive\\Desktop\\Data Engineering Python\\DEPython\\app.txt")
print(type(df))
df.show()
df.printSchema()

<class 'pyspark.sql.dataframe.DataFrame'>
+--------------------+
|               value|
+--------------------+
|I am Sriganga.I a...|
+--------------------+

root
 |-- value: string (nullable = true)

In [102]:
# c) from json file
df=spark.read.json("C:\\Users\\DELL\\OneDrive\\Desktop\\Data Engineering Python\\DEPython\\teacher.json",multiLine=True)
print(type(df))
df.show()
df.printSchema()

<class 'pyspark.sql.dataframe.DataFrame'>
+-----+----+-----------+--------+
|t_age|t_id|     t_name|t_salary|
+-----+----+-----------+--------+
|   43| 200|Dhana Laxmi|   45000|
+-----+----+-----------+--------+

root
 |-- t_age: long (nullable = true)
 |-- t_id: long (nullable = true)
 |-- t_name: string (nullable = true)
 |-- t_salary: long (nullable = true)

In [103]:
# reading multiple files
files=["C:\\Users\\DELL\\OneDrive\\Desktop\\Data Engineering Python\\DEPython\\app.txt","C:\\Users\\DELL\\OneDrive\\Desktop\\Data Engineering Python\\DEPython\\student.txt"]
df=spark.read.text(files)
df.show()
df.printSchema()

+--------------------+
|               value|
+--------------------+
|I am Sriganga.I a...|
|   Name: Shivathmika|
|             Age: 20|
|            Marks:89|
|            Grade: A|
+--------------------+

root
 |-- value: string (nullable = true)

In [104]:
# d) using pandas
df1=spark.read.csv('C:\\Users\\DELL\\OneDrive\\Desktop\\Data Engineering Python\\DEPython\\Example-1.csv',sep=',',inferSchema=True,header=True)

# converting into pandas dataframe
df2=df1.toPandas()

In [105]:
print(type(df2))

<class 'pandas.core.frame.DataFrame'>

In [106]:
df2

    ID    Name  Age  Salary
0    1    Sona   12   12000
1    2    Mona   21   43000
2    3   Bannu   13   25000
3    4  Chinnu   23   10000
4    5   sunny   14   23000
5    6    raju   24   78000
6    7     ram   15   45000
7    8   lucky   25   50000
8    9    Appy   17   60000
9   10   Lekha   38   21890
10  11  Vinnni   11   78654
11  12   pavan   19   34567
12  13    Sita   32   78901
13  14   latha   33   56455
14  15    Gita   28   25678

In [114]:
df2.rename(columns={'ID':'Rollno'},inplace=True) # inplace=True changes the column name permanently

In [117]:
df2

    Rollno    Name  Age  Salary
0        1    Sona   12   12000
1        2    Mona   21   43000
2        3   Bannu   13   25000
3        4  Chinnu   23   10000
4        5   sunny   14   23000
5        6    raju   24   78000
6        7     ram   15   45000
7        8   lucky   25   50000
8        9    Appy   17   60000
9       10   Lekha   38   21890
10      11  Vinnni   11   78654
11      12   pavan   19   34567
12      13    Sita   32   78901
13      14   latha   33   56455
14      15    Gita   28   25678

In [118]:
df2.columns=['Rollno','Stu_Name','Age','Amount_Paid']

In [119]:
df2

    Rollno Stu_Name  Age  Amount_Paid
0        1     Sona   12        12000
1        2     Mona   21        43000
2        3    Bannu   13        25000
3        4   Chinnu   23        10000
4        5    sunny   14        23000
5        6     raju   24        78000
6        7      ram   15        45000
7        8    lucky   25        50000
8        9     Appy   17        60000
9       10    Lekha   38        21890
10      11   Vinnni   11        78654
11      12    pavan   19        34567
12      13     Sita   32        78901
13      14    latha   33        56455
14      15     Gita   28        25678